org/topics/tcpip_encapsulation.org
#+created: 20151005133856288
#+creator: boru
#+modified: 20210518184433462
#+modifier: boru
#+revision: 0
#+tags: [[Layer 4]] [[Layer 3]]
#+title: TCP/IP Encapsulation
#+tmap.id: 8bb5e353-959b-4ea5-ab0b-e466bfda1aba
#+type: text/vnd.tiddlywiki

- segment :: In TCP, a term used to describe a TCP header and its encapsulated data (also called an L4PDU). Also in TCP, the process of accepting a large chunk of data from the application layer and breaking it into smaller pieces that fit into TCP segmentsIn Ethernet, a segment is either a single Ethernet cable or a single collision domain (no matter how many cables are used).
- packet :: A logical grouping of bytes that includes the network layer header and encapsulated data, but specifically does not include any headers and trailers below the network layer.
- frame :: A term referring to a data link header and trailer, plus the data encapsulated between the header and trailer.

** Encapsulation over WANs
:PROPERTIES:
:CUSTOM_ID: encapsulation-over-wans
:END:
